#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое число записано в отдельной строке.

# Числа b и h можно считывать так:
b = int(input())
h = int(input())
s = b*h/2

# Выводите результат через print()
print(s)
